MikroElektronika/core_packages/ARM/gcc_clang/def/stm/STM32F378RC/mcu.h
/*******************  Bit definition for ADC_HTR register  ********************/
#define ADC_HTR_HT_Pos                 (0U)                                    
#define ADC_HTR_HT_Msk                 (0xFFFUL << ADC_HTR_HT_Pos)              /*!< 0x00000FFF */
#define ADC_HTR_HT                     ADC_HTR_HT_Msk                          /*!< Analog watchdog high threshold */

/*******************  Bit definition for ADC_LTR register  ********************/
#define ADC_LTR_LT_Pos                 (0U)                                    
#define ADC_LTR_LT_Msk                 (0xFFFUL << ADC_LTR_LT_Pos)              /*!< 0x00000FFF */
#define ADC_LTR_LT                     ADC_LTR_LT_Msk                          /*!< Analog watchdog low threshold */

/*******************  Bit definition for ADC_SQR1 register  *******************/
#define ADC_SQR1_SQ13_Pos              (0U)                                    
#define ADC_SQR1_SQ13_Msk              (0x1FUL << ADC_SQR1_SQ13_Pos)            /*!< 0x0000001F */
#define ADC_SQR1_SQ13                  ADC_SQR1_SQ13_Msk                       /*!< SQ13[4:0] bits (13th conversion in regular sequence) */
#define ADC_SQR1_SQ13_0                (0x01UL << ADC_SQR1_SQ13_Pos)            /*!< 0x00000001 */
#define ADC_SQR1_SQ13_1                (0x02UL << ADC_SQR1_SQ13_Pos)            /*!< 0x00000002 */
#define ADC_SQR1_SQ13_2                (0x04UL << ADC_SQR1_SQ13_Pos)            /*!< 0x00000004 */
#define ADC_SQR1_SQ13_3                (0x08UL << ADC_SQR1_SQ13_Pos)            /*!< 0x00000008 */
#define ADC_SQR1_SQ13_4                (0x10UL << ADC_SQR1_SQ13_Pos)            /*!< 0x00000010 */
#define ADC_SQR1_SQ14_Pos              (5U)                                    
#define ADC_SQR1_SQ14_Msk              (0x1FUL << ADC_SQR1_SQ14_Pos)            /*!< 0x000003E0 */
#define ADC_SQR1_SQ14                  ADC_SQR1_SQ14_Msk                       /*!< SQ14[4:0] bits (14th conversion in regular sequence) */
#define ADC_SQR1_SQ14_0                (0x01UL << ADC_SQR1_SQ14_Pos)            /*!< 0x00000020 */
#define ADC_SQR1_SQ14_1                (0x02UL << ADC_SQR1_SQ14_Pos)            /*!< 0x00000040 */
#define ADC_SQR1_SQ14_2                (0x04UL << ADC_SQR1_SQ14_Pos)            /*!< 0x00000080 */
#define ADC_SQR1_SQ14_3                (0x08UL << ADC_SQR1_SQ14_Pos)            /*!< 0x00000100 */
#define ADC_SQR1_SQ14_4                (0x10UL << ADC_SQR1_SQ14_Pos)            /*!< 0x00000200 */
#define ADC_SQR1_SQ15_Pos              (10U)                                   
#define ADC_SQR1_SQ15_Msk              (0x1FUL << ADC_SQR1_SQ15_Pos)            /*!< 0x00007C00 */
#define ADC_SQR1_SQ15                  ADC_SQR1_SQ15_Msk                       /*!< SQ15[4:0] bits (15th conversion in regular sequence) */
#define ADC_SQR1_SQ15_0                (0x01UL << ADC_SQR1_SQ15_Pos)            /*!< 0x00000400 */
#define ADC_SQR1_SQ15_1                (0x02UL << ADC_SQR1_SQ15_Pos)            /*!< 0x00000800 */
#define ADC_SQR1_SQ15_2                (0x04UL << ADC_SQR1_SQ15_Pos)            /*!< 0x00001000 */
#define ADC_SQR1_SQ15_3                (0x08UL << ADC_SQR1_SQ15_Pos)            /*!< 0x00002000 */
#define ADC_SQR1_SQ15_4                (0x10UL << ADC_SQR1_SQ15_Pos)            /*!< 0x00004000 */
#define ADC_SQR1_SQ16_Pos              (15U)                                   
#define ADC_SQR1_SQ16_Msk              (0x1FUL << ADC_SQR1_SQ16_Pos)            /*!< 0x000F8000 */
#define ADC_SQR1_SQ16                  ADC_SQR1_SQ16_Msk                       /*!< SQ16[4:0] bits (16th conversion in regular sequence) */
#define ADC_SQR1_SQ16_0                (0x01UL << ADC_SQR1_SQ16_Pos)            /*!< 0x00008000 */
#define ADC_SQR1_SQ16_1                (0x02UL << ADC_SQR1_SQ16_Pos)            /*!< 0x00010000 */
#define ADC_SQR1_SQ16_2                (0x04UL << ADC_SQR1_SQ16_Pos)            /*!< 0x00020000 */
#define ADC_SQR1_SQ16_3                (0x08UL << ADC_SQR1_SQ16_Pos)            /*!< 0x00040000 */
#define ADC_SQR1_SQ16_4                (0x10UL << ADC_SQR1_SQ16_Pos)            /*!< 0x00080000 */
#define ADC_SQR1_L_Pos                 (20U)                                   
#define ADC_SQR1_L_Msk                 (0xFUL << ADC_SQR1_L_Pos)                /*!< 0x00F00000 */
#define ADC_SQR1_L                     ADC_SQR1_L_Msk                          /*!< L[3:0] bits (Regular channel sequence length) */
#define ADC_SQR1_L_0                   (0x1UL << ADC_SQR1_L_Pos)                /*!< 0x00100000 */
#define ADC_SQR1_L_1                   (0x2UL << ADC_SQR1_L_Pos)                /*!< 0x00200000 */
#define ADC_SQR1_L_2                   (0x4UL << ADC_SQR1_L_Pos)                /*!< 0x00400000 */
#define ADC_SQR1_L_3                   (0x8UL << ADC_SQR1_L_Pos)                /*!< 0x00800000 */

/*******************  Bit definition for ADC_SQR2 register  *******************/
#define ADC_SQR2_SQ7_Pos               (0U)                                    
#define ADC_SQR2_SQ7_Msk               (0x1FUL << ADC_SQR2_SQ7_Pos)             /*!< 0x0000001F */
#define ADC_SQR2_SQ7                   ADC_SQR2_SQ7_Msk                        /*!< SQ7[4:0] bits (7th conversion in regular sequence) */
#define ADC_SQR2_SQ7_0                 (0x01UL << ADC_SQR2_SQ7_Pos)             /*!< 0x00000001 */
#define ADC_SQR2_SQ7_1                 (0x02UL << ADC_SQR2_SQ7_Pos)             /*!< 0x00000002 */
#define ADC_SQR2_SQ7_2                 (0x04UL << ADC_SQR2_SQ7_Pos)             /*!< 0x00000004 */
#define ADC_SQR2_SQ7_3                 (0x08UL << ADC_SQR2_SQ7_Pos)             /*!< 0x00000008 */
#define ADC_SQR2_SQ7_4                 (0x10UL << ADC_SQR2_SQ7_Pos)             /*!< 0x00000010 */
#define ADC_SQR2_SQ8_Pos               (5U)                                    
#define ADC_SQR2_SQ8_Msk               (0x1FUL << ADC_SQR2_SQ8_Pos)             /*!< 0x000003E0 */
#define ADC_SQR2_SQ8                   ADC_SQR2_SQ8_Msk                        /*!< SQ8[4:0] bits (8th conversion in regular sequence) */
#define ADC_SQR2_SQ8_0                 (0x01UL << ADC_SQR2_SQ8_Pos)             /*!< 0x00000020 */
#define ADC_SQR2_SQ8_1                 (0x02UL << ADC_SQR2_SQ8_Pos)             /*!< 0x00000040 */
#define ADC_SQR2_SQ8_2                 (0x04UL << ADC_SQR2_SQ8_Pos)             /*!< 0x00000080 */
#define ADC_SQR2_SQ8_3                 (0x08UL << ADC_SQR2_SQ8_Pos)             /*!< 0x00000100 */
#define ADC_SQR2_SQ8_4                 (0x10UL << ADC_SQR2_SQ8_Pos)             /*!< 0x00000200 */
#define ADC_SQR2_SQ9_Pos               (10U)                                   
#define ADC_SQR2_SQ9_Msk               (0x1FUL << ADC_SQR2_SQ9_Pos)             /*!< 0x00007C00 */
#define ADC_SQR2_SQ9                   ADC_SQR2_SQ9_Msk                        /*!< SQ9[4:0] bits (9th conversion in regular sequence) */
#define ADC_SQR2_SQ9_0                 (0x01UL << ADC_SQR2_SQ9_Pos)             /*!< 0x00000400 */
#define ADC_SQR2_SQ9_1                 (0x02UL << ADC_SQR2_SQ9_Pos)             /*!< 0x00000800 */
#define ADC_SQR2_SQ9_2                 (0x04UL << ADC_SQR2_SQ9_Pos)             /*!< 0x00001000 */
#define ADC_SQR2_SQ9_3                 (0x08UL << ADC_SQR2_SQ9_Pos)             /*!< 0x00002000 */
#define ADC_SQR2_SQ9_4                 (0x10UL << ADC_SQR2_SQ9_Pos)             /*!< 0x00004000 */
#define ADC_SQR2_SQ10_Pos              (15U)                                   
#define ADC_SQR2_SQ10_Msk              (0x1FUL << ADC_SQR2_SQ10_Pos)            /*!< 0x000F8000 */
#define ADC_SQR2_SQ10                  ADC_SQR2_SQ10_Msk                       /*!< SQ10[4:0] bits (10th conversion in regular sequence) */
#define ADC_SQR2_SQ10_0                (0x01UL << ADC_SQR2_SQ10_Pos)            /*!< 0x00008000 */
#define ADC_SQR2_SQ10_1                (0x02UL << ADC_SQR2_SQ10_Pos)            /*!< 0x00010000 */
#define ADC_SQR2_SQ10_2                (0x04UL << ADC_SQR2_SQ10_Pos)            /*!< 0x00020000 */
#define ADC_SQR2_SQ10_3                (0x08UL << ADC_SQR2_SQ10_Pos)            /*!< 0x00040000 */
#define ADC_SQR2_SQ10_4                (0x10UL << ADC_SQR2_SQ10_Pos)            /*!< 0x00080000 */
#define ADC_SQR2_SQ11_Pos              (20U)                                   
#define ADC_SQR2_SQ11_Msk              (0x1FUL << ADC_SQR2_SQ11_Pos)            /*!< 0x01F00000 */
#define ADC_SQR2_SQ11                  ADC_SQR2_SQ11_Msk                       /*!< SQ11[4:0] bits (11th conversion in regular sequence) */
#define ADC_SQR2_SQ11_0                (0x01UL << ADC_SQR2_SQ11_Pos)            /*!< 0x00100000 */
#define ADC_SQR2_SQ11_1                (0x02UL << ADC_SQR2_SQ11_Pos)            /*!< 0x00200000 */
#define ADC_SQR2_SQ11_2                (0x04UL << ADC_SQR2_SQ11_Pos)            /*!< 0x00400000 */
#define ADC_SQR2_SQ11_3                (0x08UL << ADC_SQR2_SQ11_Pos)            /*!< 0x00800000 */
#define ADC_SQR2_SQ11_4                (0x10UL << ADC_SQR2_SQ11_Pos)            /*!< 0x01000000 */
#define ADC_SQR2_SQ12_Pos              (25U)                                   
#define ADC_SQR2_SQ12_Msk              (0x1FUL << ADC_SQR2_SQ12_Pos)            /*!< 0x3E000000 */
#define ADC_SQR2_SQ12                  ADC_SQR2_SQ12_Msk                       /*!< SQ12[4:0] bits (12th conversion in regular sequence) */
#define ADC_SQR2_SQ12_0                (0x01UL << ADC_SQR2_SQ12_Pos)            /*!< 0x02000000 */
#define ADC_SQR2_SQ12_1                (0x02UL << ADC_SQR2_SQ12_Pos)            /*!< 0x04000000 */
#define ADC_SQR2_SQ12_2                (0x04UL << ADC_SQR2_SQ12_Pos)            /*!< 0x08000000 */
#define ADC_SQR2_SQ12_3                (0x08UL << ADC_SQR2_SQ12_Pos)            /*!< 0x10000000 */
#define ADC_SQR2_SQ12_4                (0x10UL << ADC_SQR2_SQ12_Pos)            /*!< 0x20000000 */

