MikroElektronika/core_packages/ARM/gcc_clang/def/stm/STM32F378RC/mcu.h
/*******************  Bit definition for ADC_SQR3 register  *******************/
#define ADC_SQR3_SQ1_Pos               (0U)                                    
#define ADC_SQR3_SQ1_Msk               (0x1FUL << ADC_SQR3_SQ1_Pos)             /*!< 0x0000001F */
#define ADC_SQR3_SQ1                   ADC_SQR3_SQ1_Msk                        /*!< SQ1[4:0] bits (1st conversion in regular sequence) */
#define ADC_SQR3_SQ1_0                 (0x01UL << ADC_SQR3_SQ1_Pos)             /*!< 0x00000001 */
#define ADC_SQR3_SQ1_1                 (0x02UL << ADC_SQR3_SQ1_Pos)             /*!< 0x00000002 */
#define ADC_SQR3_SQ1_2                 (0x04UL << ADC_SQR3_SQ1_Pos)             /*!< 0x00000004 */
#define ADC_SQR3_SQ1_3                 (0x08UL << ADC_SQR3_SQ1_Pos)             /*!< 0x00000008 */
#define ADC_SQR3_SQ1_4                 (0x10UL << ADC_SQR3_SQ1_Pos)             /*!< 0x00000010 */
#define ADC_SQR3_SQ2_Pos               (5U)                                    
#define ADC_SQR3_SQ2_Msk               (0x1FUL << ADC_SQR3_SQ2_Pos)             /*!< 0x000003E0 */
#define ADC_SQR3_SQ2                   ADC_SQR3_SQ2_Msk                        /*!< SQ2[4:0] bits (2nd conversion in regular sequence) */
#define ADC_SQR3_SQ2_0                 (0x01UL << ADC_SQR3_SQ2_Pos)             /*!< 0x00000020 */
#define ADC_SQR3_SQ2_1                 (0x02UL << ADC_SQR3_SQ2_Pos)             /*!< 0x00000040 */
#define ADC_SQR3_SQ2_2                 (0x04UL << ADC_SQR3_SQ2_Pos)             /*!< 0x00000080 */
#define ADC_SQR3_SQ2_3                 (0x08UL << ADC_SQR3_SQ2_Pos)             /*!< 0x00000100 */
#define ADC_SQR3_SQ2_4                 (0x10UL << ADC_SQR3_SQ2_Pos)             /*!< 0x00000200 */
#define ADC_SQR3_SQ3_Pos               (10U)                                   
#define ADC_SQR3_SQ3_Msk               (0x1FUL << ADC_SQR3_SQ3_Pos)             /*!< 0x00007C00 */
#define ADC_SQR3_SQ3                   ADC_SQR3_SQ3_Msk                        /*!< SQ3[4:0] bits (3rd conversion in regular sequence) */
#define ADC_SQR3_SQ3_0                 (0x01UL << ADC_SQR3_SQ3_Pos)             /*!< 0x00000400 */
#define ADC_SQR3_SQ3_1                 (0x02UL << ADC_SQR3_SQ3_Pos)             /*!< 0x00000800 */
#define ADC_SQR3_SQ3_2                 (0x04UL << ADC_SQR3_SQ3_Pos)             /*!< 0x00001000 */
#define ADC_SQR3_SQ3_3                 (0x08UL << ADC_SQR3_SQ3_Pos)             /*!< 0x00002000 */
#define ADC_SQR3_SQ3_4                 (0x10UL << ADC_SQR3_SQ3_Pos)             /*!< 0x00004000 */
#define ADC_SQR3_SQ4_Pos               (15U)                                   
#define ADC_SQR3_SQ4_Msk               (0x1FUL << ADC_SQR3_SQ4_Pos)             /*!< 0x000F8000 */
#define ADC_SQR3_SQ4                   ADC_SQR3_SQ4_Msk                        /*!< SQ4[4:0] bits (4th conversion in regular sequence) */
#define ADC_SQR3_SQ4_0                 (0x01UL << ADC_SQR3_SQ4_Pos)             /*!< 0x00008000 */
#define ADC_SQR3_SQ4_1                 (0x02UL << ADC_SQR3_SQ4_Pos)             /*!< 0x00010000 */
#define ADC_SQR3_SQ4_2                 (0x04UL << ADC_SQR3_SQ4_Pos)             /*!< 0x00020000 */
#define ADC_SQR3_SQ4_3                 (0x08UL << ADC_SQR3_SQ4_Pos)             /*!< 0x00040000 */
#define ADC_SQR3_SQ4_4                 (0x10UL << ADC_SQR3_SQ4_Pos)             /*!< 0x00080000 */
#define ADC_SQR3_SQ5_Pos               (20U)                                   
#define ADC_SQR3_SQ5_Msk               (0x1FUL << ADC_SQR3_SQ5_Pos)             /*!< 0x01F00000 */
#define ADC_SQR3_SQ5                   ADC_SQR3_SQ5_Msk                        /*!< SQ5[4:0] bits (5th conversion in regular sequence) */
#define ADC_SQR3_SQ5_0                 (0x01UL << ADC_SQR3_SQ5_Pos)             /*!< 0x00100000 */
#define ADC_SQR3_SQ5_1                 (0x02UL << ADC_SQR3_SQ5_Pos)             /*!< 0x00200000 */
#define ADC_SQR3_SQ5_2                 (0x04UL << ADC_SQR3_SQ5_Pos)             /*!< 0x00400000 */
#define ADC_SQR3_SQ5_3                 (0x08UL << ADC_SQR3_SQ5_Pos)             /*!< 0x00800000 */
#define ADC_SQR3_SQ5_4                 (0x10UL << ADC_SQR3_SQ5_Pos)             /*!< 0x01000000 */
#define ADC_SQR3_SQ6_Pos               (25U)                                   
#define ADC_SQR3_SQ6_Msk               (0x1FUL << ADC_SQR3_SQ6_Pos)             /*!< 0x3E000000 */
#define ADC_SQR3_SQ6                   ADC_SQR3_SQ6_Msk                        /*!< SQ6[4:0] bits (6th conversion in regular sequence) */
#define ADC_SQR3_SQ6_0                 (0x01UL << ADC_SQR3_SQ6_Pos)             /*!< 0x02000000 */
#define ADC_SQR3_SQ6_1                 (0x02UL << ADC_SQR3_SQ6_Pos)             /*!< 0x04000000 */
#define ADC_SQR3_SQ6_2                 (0x04UL << ADC_SQR3_SQ6_Pos)             /*!< 0x08000000 */
#define ADC_SQR3_SQ6_3                 (0x08UL << ADC_SQR3_SQ6_Pos)             /*!< 0x10000000 */
#define ADC_SQR3_SQ6_4                 (0x10UL << ADC_SQR3_SQ6_Pos)             /*!< 0x20000000 */

/*******************  Bit definition for ADC_JSQR register  *******************/
#define ADC_JSQR_JSQ1_Pos              (0U)                                    
#define ADC_JSQR_JSQ1_Msk              (0x1FUL << ADC_JSQR_JSQ1_Pos)            /*!< 0x0000001F */
#define ADC_JSQR_JSQ1                  ADC_JSQR_JSQ1_Msk                       /*!< JSQ1[4:0] bits (1st conversion in injected sequence) */
#define ADC_JSQR_JSQ1_0                (0x01UL << ADC_JSQR_JSQ1_Pos)            /*!< 0x00000001 */
#define ADC_JSQR_JSQ1_1                (0x02UL << ADC_JSQR_JSQ1_Pos)            /*!< 0x00000002 */
#define ADC_JSQR_JSQ1_2                (0x04UL << ADC_JSQR_JSQ1_Pos)            /*!< 0x00000004 */
#define ADC_JSQR_JSQ1_3                (0x08UL << ADC_JSQR_JSQ1_Pos)            /*!< 0x00000008 */
#define ADC_JSQR_JSQ1_4                (0x10UL << ADC_JSQR_JSQ1_Pos)            /*!< 0x00000010 */
#define ADC_JSQR_JSQ2_Pos              (5U)                                    
#define ADC_JSQR_JSQ2_Msk              (0x1FUL << ADC_JSQR_JSQ2_Pos)            /*!< 0x000003E0 */
#define ADC_JSQR_JSQ2                  ADC_JSQR_JSQ2_Msk                       /*!< JSQ2[4:0] bits (2nd conversion in injected sequence) */
#define ADC_JSQR_JSQ2_0                (0x01UL << ADC_JSQR_JSQ2_Pos)            /*!< 0x00000020 */
#define ADC_JSQR_JSQ2_1                (0x02UL << ADC_JSQR_JSQ2_Pos)            /*!< 0x00000040 */
#define ADC_JSQR_JSQ2_2                (0x04UL << ADC_JSQR_JSQ2_Pos)            /*!< 0x00000080 */
#define ADC_JSQR_JSQ2_3                (0x08UL << ADC_JSQR_JSQ2_Pos)            /*!< 0x00000100 */
#define ADC_JSQR_JSQ2_4                (0x10UL << ADC_JSQR_JSQ2_Pos)            /*!< 0x00000200 */
#define ADC_JSQR_JSQ3_Pos              (10U)                                   
#define ADC_JSQR_JSQ3_Msk              (0x1FUL << ADC_JSQR_JSQ3_Pos)            /*!< 0x00007C00 */
#define ADC_JSQR_JSQ3                  ADC_JSQR_JSQ3_Msk                       /*!< JSQ3[4:0] bits (3rd conversion in injected sequence) */
#define ADC_JSQR_JSQ3_0                (0x01UL << ADC_JSQR_JSQ3_Pos)            /*!< 0x00000400 */
#define ADC_JSQR_JSQ3_1                (0x02UL << ADC_JSQR_JSQ3_Pos)            /*!< 0x00000800 */
#define ADC_JSQR_JSQ3_2                (0x04UL << ADC_JSQR_JSQ3_Pos)            /*!< 0x00001000 */
#define ADC_JSQR_JSQ3_3                (0x08UL << ADC_JSQR_JSQ3_Pos)            /*!< 0x00002000 */
#define ADC_JSQR_JSQ3_4                (0x10UL << ADC_JSQR_JSQ3_Pos)            /*!< 0x00004000 */
#define ADC_JSQR_JSQ4_Pos              (15U)                                   
#define ADC_JSQR_JSQ4_Msk              (0x1FUL << ADC_JSQR_JSQ4_Pos)            /*!< 0x000F8000 */
#define ADC_JSQR_JSQ4                  ADC_JSQR_JSQ4_Msk                       /*!< JSQ4[4:0] bits (4th conversion in injected sequence) */
#define ADC_JSQR_JSQ4_0                (0x01UL << ADC_JSQR_JSQ4_Pos)            /*!< 0x00008000 */
#define ADC_JSQR_JSQ4_1                (0x02UL << ADC_JSQR_JSQ4_Pos)            /*!< 0x00010000 */
#define ADC_JSQR_JSQ4_2                (0x04UL << ADC_JSQR_JSQ4_Pos)            /*!< 0x00020000 */
#define ADC_JSQR_JSQ4_3                (0x08UL << ADC_JSQR_JSQ4_Pos)            /*!< 0x00040000 */
#define ADC_JSQR_JSQ4_4                (0x10UL << ADC_JSQR_JSQ4_Pos)            /*!< 0x00080000 */
#define ADC_JSQR_JL_Pos                (20U)                                   
#define ADC_JSQR_JL_Msk                (0x3UL << ADC_JSQR_JL_Pos)               /*!< 0x00300000 */
#define ADC_JSQR_JL                    ADC_JSQR_JL_Msk                         /*!< JL[1:0] bits (Injected Sequence length) */
#define ADC_JSQR_JL_0                  (0x1UL << ADC_JSQR_JL_Pos)               /*!< 0x00100000 */
#define ADC_JSQR_JL_1                  (0x2UL << ADC_JSQR_JL_Pos)               /*!< 0x00200000 */

/*******************  Bit definition for ADC_JDR1 register  *******************/
#define ADC_JDR1_JDATA                 ((uint16_t)0xFFFFU)                     /*!< Injected data */

/*******************  Bit definition for ADC_JDR2 register  *******************/
#define ADC_JDR2_JDATA                 ((uint16_t)0xFFFFU)                     /*!< Injected data */

/*******************  Bit definition for ADC_JDR3 register  *******************/
#define ADC_JDR3_JDATA                 ((uint16_t)0xFFFFU)                     /*!< Injected data */

/*******************  Bit definition for ADC_JDR4 register  *******************/
#define ADC_JDR4_JDATA                 ((uint16_t)0xFFFFU)                     /*!< Injected data */

