MikroElektronika/core_packages/ARM/gcc_clang/def/stm/STM32F378RC/mcu.h
/*!< SDPRE configuration */
#define RCC_CFGR_SDPRE_Pos                    (27U)                         
#define RCC_CFGR_SDPRE_Msk                    (0x1FUL << RCC_CFGR_SDPRE_Pos) /*!< 0xF8000000 */
#define RCC_CFGR_SDPRE                        RCC_CFGR_SDPRE_Msk         /*!< SDPRE[4:0] bits (Sigma Delta ADC prescaler) */
#define RCC_CFGR_SDPRE_0                      (0x01UL << RCC_CFGR_SDPRE_Pos) /*!< 0x08000000 */
#define RCC_CFGR_SDPRE_1                      (0x02UL << RCC_CFGR_SDPRE_Pos) /*!< 0x10000000 */
#define RCC_CFGR_SDPRE_2                      (0x04UL << RCC_CFGR_SDPRE_Pos) /*!< 0x20000000 */
#define RCC_CFGR_SDPRE_3                      (0x08UL << RCC_CFGR_SDPRE_Pos) /*!< 0x40000000 */
#define RCC_CFGR_SDPRE_4                      (0x10UL << RCC_CFGR_SDPRE_Pos) /*!< 0x80000000 */

#define RCC_CFGR_SDPRE_DIV1                   (0x00000000U)                 /*!< SDADC CLK not divided */
#define RCC_CFGR_SDPRE_DIV2                   (0x80000000U)                 /*!< SDADC CLK divided by 2 */
#define RCC_CFGR_SDPRE_DIV4                   (0x88000000U)                 /*!< SDADC CLK divided by 4 */
#define RCC_CFGR_SDPRE_DIV6                   (0x90000000U)                 /*!< SDADC CLK divided by 6 */
#define RCC_CFGR_SDPRE_DIV8                   (0x98000000U)                 /*!< SDADC CLK divided by 8 */
#define RCC_CFGR_SDPRE_DIV10                  (0xA0000000U)                 /*!< SDADC CLK divided by 10 */
#define RCC_CFGR_SDPRE_DIV12                  (0xA8000000U)                 /*!< SDADC CLK divided by 12 */
#define RCC_CFGR_SDPRE_DIV14                  (0xB0000000U)                 /*!< SDADC CLK divided by 14 */
#define RCC_CFGR_SDPRE_DIV16                  (0xB8000000U)                 /*!< SDADC CLK divided by 16 */
#define RCC_CFGR_SDPRE_DIV20                  (0xC0000000U)                 /*!< SDADC CLK divided by 20 */
#define RCC_CFGR_SDPRE_DIV24                  (0xC8000000U)                 /*!< SDADC CLK divided by 24 */
#define RCC_CFGR_SDPRE_DIV28                  (0xD0000000U)                 /*!< SDADC CLK divided by 28 */
#define RCC_CFGR_SDPRE_DIV32                  (0xD8000000U)                 /*!< SDADC CLK divided by 32 */
#define RCC_CFGR_SDPRE_DIV36                  (0xE0000000U)                 /*!< SDADC CLK divided by 36 */
#define RCC_CFGR_SDPRE_DIV40                  (0xE8000000U)                 /*!< SDADC CLK divided by 40 */
#define RCC_CFGR_SDPRE_DIV44                  (0xF0000000U)                 /*!< SDADC CLK divided by 44 */
#define RCC_CFGR_SDPRE_DIV48                  (0xF8000000U)                 /*!< SDADC CLK divided by 48 */

/* Legacy aliases */
#define RCC_CFGR_SDADCPRE_Pos                  RCC_CFGR_SDPRE_Pos
#define RCC_CFGR_SDADCPRE_Msk                  RCC_CFGR_SDPRE_Msk
#define RCC_CFGR_SDADCPRE                      RCC_CFGR_SDPRE
#define RCC_CFGR_SDADCPRE_0                    RCC_CFGR_SDPRE_0
#define RCC_CFGR_SDADCPRE_1                    RCC_CFGR_SDPRE_1
#define RCC_CFGR_SDADCPRE_2                    RCC_CFGR_SDPRE_2
#define RCC_CFGR_SDADCPRE_3                    RCC_CFGR_SDPRE_3
#define RCC_CFGR_SDADCPRE_4                    RCC_CFGR_SDPRE_4

#define RCC_CFGR_SDADCPRE_DIV1                 RCC_CFGR_SDPRE_DIV1
#define RCC_CFGR_SDADCPRE_DIV2                 RCC_CFGR_SDPRE_DIV2
#define RCC_CFGR_SDADCPRE_DIV4                 RCC_CFGR_SDPRE_DIV4
#define RCC_CFGR_SDADCPRE_DIV6                 RCC_CFGR_SDPRE_DIV6
#define RCC_CFGR_SDADCPRE_DIV8                 RCC_CFGR_SDPRE_DIV8
#define RCC_CFGR_SDADCPRE_DIV10                RCC_CFGR_SDPRE_DIV10
#define RCC_CFGR_SDADCPRE_DIV12                RCC_CFGR_SDPRE_DIV12
#define RCC_CFGR_SDADCPRE_DIV14                RCC_CFGR_SDPRE_DIV14
#define RCC_CFGR_SDADCPRE_DIV16                RCC_CFGR_SDPRE_DIV16
#define RCC_CFGR_SDADCPRE_DIV20                RCC_CFGR_SDPRE_DIV20
#define RCC_CFGR_SDADCPRE_DIV24                RCC_CFGR_SDPRE_DIV24
#define RCC_CFGR_SDADCPRE_DIV28                RCC_CFGR_SDPRE_DIV28
#define RCC_CFGR_SDADCPRE_DIV32                RCC_CFGR_SDPRE_DIV32
#define RCC_CFGR_SDADCPRE_DIV36                RCC_CFGR_SDPRE_DIV36
#define RCC_CFGR_SDADCPRE_DIV40                RCC_CFGR_SDPRE_DIV40
#define RCC_CFGR_SDADCPRE_DIV44                RCC_CFGR_SDPRE_DIV44
#define RCC_CFGR_SDADCPRE_DIV48                RCC_CFGR_SDPRE_DIV48

/*********************  Bit definition for RCC_CIR register  ********************/
#define RCC_CIR_LSIRDYF_Pos                      (0U)                          
#define RCC_CIR_LSIRDYF_Msk                      (0x1UL << RCC_CIR_LSIRDYF_Pos) /*!< 0x00000001 */
#define RCC_CIR_LSIRDYF                          RCC_CIR_LSIRDYF_Msk           /*!< LSI Ready Interrupt flag */
#define RCC_CIR_LSERDYF_Pos                      (1U)                          
#define RCC_CIR_LSERDYF_Msk                      (0x1UL << RCC_CIR_LSERDYF_Pos) /*!< 0x00000002 */
#define RCC_CIR_LSERDYF                          RCC_CIR_LSERDYF_Msk           /*!< LSE Ready Interrupt flag */
#define RCC_CIR_HSIRDYF_Pos                      (2U)                          
#define RCC_CIR_HSIRDYF_Msk                      (0x1UL << RCC_CIR_HSIRDYF_Pos) /*!< 0x00000004 */
#define RCC_CIR_HSIRDYF                          RCC_CIR_HSIRDYF_Msk           /*!< HSI Ready Interrupt flag */
#define RCC_CIR_HSERDYF_Pos                      (3U)                          
#define RCC_CIR_HSERDYF_Msk                      (0x1UL << RCC_CIR_HSERDYF_Pos) /*!< 0x00000008 */
#define RCC_CIR_HSERDYF                          RCC_CIR_HSERDYF_Msk           /*!< HSE Ready Interrupt flag */
#define RCC_CIR_PLLRDYF_Pos                      (4U)                          
#define RCC_CIR_PLLRDYF_Msk                      (0x1UL << RCC_CIR_PLLRDYF_Pos) /*!< 0x00000010 */
#define RCC_CIR_PLLRDYF                          RCC_CIR_PLLRDYF_Msk           /*!< PLL Ready Interrupt flag */
#define RCC_CIR_CSSF_Pos                         (7U)                          
#define RCC_CIR_CSSF_Msk                         (0x1UL << RCC_CIR_CSSF_Pos)    /*!< 0x00000080 */
#define RCC_CIR_CSSF                             RCC_CIR_CSSF_Msk              /*!< Clock Security System Interrupt flag */
#define RCC_CIR_LSIRDYIE_Pos                     (8U)                          
#define RCC_CIR_LSIRDYIE_Msk                     (0x1UL << RCC_CIR_LSIRDYIE_Pos) /*!< 0x00000100 */
#define RCC_CIR_LSIRDYIE                         RCC_CIR_LSIRDYIE_Msk          /*!< LSI Ready Interrupt Enable */
#define RCC_CIR_LSERDYIE_Pos                     (9U)                          
#define RCC_CIR_LSERDYIE_Msk                     (0x1UL << RCC_CIR_LSERDYIE_Pos) /*!< 0x00000200 */
#define RCC_CIR_LSERDYIE                         RCC_CIR_LSERDYIE_Msk          /*!< LSE Ready Interrupt Enable */
#define RCC_CIR_HSIRDYIE_Pos                     (10U)                         
#define RCC_CIR_HSIRDYIE_Msk                     (0x1UL << RCC_CIR_HSIRDYIE_Pos) /*!< 0x00000400 */
#define RCC_CIR_HSIRDYIE                         RCC_CIR_HSIRDYIE_Msk          /*!< HSI Ready Interrupt Enable */
#define RCC_CIR_HSERDYIE_Pos                     (11U)                         
#define RCC_CIR_HSERDYIE_Msk                     (0x1UL << RCC_CIR_HSERDYIE_Pos) /*!< 0x00000800 */
#define RCC_CIR_HSERDYIE                         RCC_CIR_HSERDYIE_Msk          /*!< HSE Ready Interrupt Enable */
#define RCC_CIR_PLLRDYIE_Pos                     (12U)                         
#define RCC_CIR_PLLRDYIE_Msk                     (0x1UL << RCC_CIR_PLLRDYIE_Pos) /*!< 0x00001000 */
#define RCC_CIR_PLLRDYIE                         RCC_CIR_PLLRDYIE_Msk          /*!< PLL Ready Interrupt Enable */
#define RCC_CIR_LSIRDYC_Pos                      (16U)                         
#define RCC_CIR_LSIRDYC_Msk                      (0x1UL << RCC_CIR_LSIRDYC_Pos) /*!< 0x00010000 */
#define RCC_CIR_LSIRDYC                          RCC_CIR_LSIRDYC_Msk           /*!< LSI Ready Interrupt Clear */
#define RCC_CIR_LSERDYC_Pos                      (17U)                         
#define RCC_CIR_LSERDYC_Msk                      (0x1UL << RCC_CIR_LSERDYC_Pos) /*!< 0x00020000 */
#define RCC_CIR_LSERDYC                          RCC_CIR_LSERDYC_Msk           /*!< LSE Ready Interrupt Clear */
#define RCC_CIR_HSIRDYC_Pos                      (18U)                         
#define RCC_CIR_HSIRDYC_Msk                      (0x1UL << RCC_CIR_HSIRDYC_Pos) /*!< 0x00040000 */
#define RCC_CIR_HSIRDYC                          RCC_CIR_HSIRDYC_Msk           /*!< HSI Ready Interrupt Clear */
#define RCC_CIR_HSERDYC_Pos                      (19U)                         
#define RCC_CIR_HSERDYC_Msk                      (0x1UL << RCC_CIR_HSERDYC_Pos) /*!< 0x00080000 */
#define RCC_CIR_HSERDYC                          RCC_CIR_HSERDYC_Msk           /*!< HSE Ready Interrupt Clear */
#define RCC_CIR_PLLRDYC_Pos                      (20U)                         
#define RCC_CIR_PLLRDYC_Msk                      (0x1UL << RCC_CIR_PLLRDYC_Pos) /*!< 0x00100000 */
#define RCC_CIR_PLLRDYC                          RCC_CIR_PLLRDYC_Msk           /*!< PLL Ready Interrupt Clear */
#define RCC_CIR_CSSC_Pos                         (23U)                         
#define RCC_CIR_CSSC_Msk                         (0x1UL << RCC_CIR_CSSC_Pos)    /*!< 0x00800000 */
#define RCC_CIR_CSSC                             RCC_CIR_CSSC_Msk              /*!< Clock Security System Interrupt Clear */

/******************  Bit definition for RCC_APB2RSTR register  *****************/
#define RCC_APB2RSTR_SYSCFGRST_Pos               (0U)                          
#define RCC_APB2RSTR_SYSCFGRST_Msk               (0x1UL << RCC_APB2RSTR_SYSCFGRST_Pos) /*!< 0x00000001 */
#define RCC_APB2RSTR_SYSCFGRST                   RCC_APB2RSTR_SYSCFGRST_Msk    /*!< SYSCFG reset */
#define RCC_APB2RSTR_ADC1RST_Pos                 (9U)                          
#define RCC_APB2RSTR_ADC1RST_Msk                 (0x1UL << RCC_APB2RSTR_ADC1RST_Pos) /*!< 0x00000200 */
#define RCC_APB2RSTR_ADC1RST                     RCC_APB2RSTR_ADC1RST_Msk      /*!< ADC1 reset */
#define RCC_APB2RSTR_SPI1RST_Pos                 (12U)                         
#define RCC_APB2RSTR_SPI1RST_Msk                 (0x1UL << RCC_APB2RSTR_SPI1RST_Pos) /*!< 0x00001000 */
#define RCC_APB2RSTR_SPI1RST                     RCC_APB2RSTR_SPI1RST_Msk      /*!< SPI1 reset */
#define RCC_APB2RSTR_USART1RST_Pos               (14U)                         
#define RCC_APB2RSTR_USART1RST_Msk               (0x1UL << RCC_APB2RSTR_USART1RST_Pos) /*!< 0x00004000 */
#define RCC_APB2RSTR_USART1RST                   RCC_APB2RSTR_USART1RST_Msk    /*!< USART1 reset */
#define RCC_APB2RSTR_TIM15RST_Pos                (16U)                         
#define RCC_APB2RSTR_TIM15RST_Msk                (0x1UL << RCC_APB2RSTR_TIM15RST_Pos) /*!< 0x00010000 */
#define RCC_APB2RSTR_TIM15RST                    RCC_APB2RSTR_TIM15RST_Msk     /*!< TIM15 reset */
#define RCC_APB2RSTR_TIM16RST_Pos                (17U)                         
#define RCC_APB2RSTR_TIM16RST_Msk                (0x1UL << RCC_APB2RSTR_TIM16RST_Pos) /*!< 0x00020000 */
#define RCC_APB2RSTR_TIM16RST                    RCC_APB2RSTR_TIM16RST_Msk     /*!< TIM16 reset */
#define RCC_APB2RSTR_TIM17RST_Pos                (18U)                         
#define RCC_APB2RSTR_TIM17RST_Msk                (0x1UL << RCC_APB2RSTR_TIM17RST_Pos) /*!< 0x00040000 */
#define RCC_APB2RSTR_TIM17RST                    RCC_APB2RSTR_TIM17RST_Msk     /*!< TIM17 reset */
#define RCC_APB2RSTR_TIM19RST_Pos                (19U)                         
#define RCC_APB2RSTR_TIM19RST_Msk                (0x1UL << RCC_APB2RSTR_TIM19RST_Pos) /*!< 0x00080000 */
#define RCC_APB2RSTR_TIM19RST                    RCC_APB2RSTR_TIM19RST_Msk     /*!< TIM19 reset */
#define RCC_APB2RSTR_SDADC1RST_Pos               (24U)                         
#define RCC_APB2RSTR_SDADC1RST_Msk               (0x1UL << RCC_APB2RSTR_SDADC1RST_Pos) /*!< 0x01000000 */
#define RCC_APB2RSTR_SDADC1RST                   RCC_APB2RSTR_SDADC1RST_Msk    /*!< SDADC1 reset */
#define RCC_APB2RSTR_SDADC2RST_Pos               (25U)                         
#define RCC_APB2RSTR_SDADC2RST_Msk               (0x1UL << RCC_APB2RSTR_SDADC2RST_Pos) /*!< 0x02000000 */
#define RCC_APB2RSTR_SDADC2RST                   RCC_APB2RSTR_SDADC2RST_Msk    /*!< SDADC2 reset */
#define RCC_APB2RSTR_SDADC3RST_Pos               (26U)                         
#define RCC_APB2RSTR_SDADC3RST_Msk               (0x1UL << RCC_APB2RSTR_SDADC3RST_Pos) /*!< 0x04000000 */
#define RCC_APB2RSTR_SDADC3RST                   RCC_APB2RSTR_SDADC3RST_Msk    /*!< SDADC3 reset */

/******************  Bit definition for RCC_APB1RSTR register  ******************/
#define RCC_APB1RSTR_TIM2RST_Pos                 (0U)                          
#define RCC_APB1RSTR_TIM2RST_Msk                 (0x1UL << RCC_APB1RSTR_TIM2RST_Pos) /*!< 0x00000001 */
#define RCC_APB1RSTR_TIM2RST                     RCC_APB1RSTR_TIM2RST_Msk      /*!< Timer 2 reset */
#define RCC_APB1RSTR_TIM3RST_Pos                 (1U)                          
#define RCC_APB1RSTR_TIM3RST_Msk                 (0x1UL << RCC_APB1RSTR_TIM3RST_Pos) /*!< 0x00000002 */
#define RCC_APB1RSTR_TIM3RST                     RCC_APB1RSTR_TIM3RST_Msk      /*!< Timer 3 reset */
#define RCC_APB1RSTR_TIM4RST_Pos                 (2U)                          
#define RCC_APB1RSTR_TIM4RST_Msk                 (0x1UL << RCC_APB1RSTR_TIM4RST_Pos) /*!< 0x00000004 */
#define RCC_APB1RSTR_TIM4RST                     RCC_APB1RSTR_TIM4RST_Msk      /*!< Timer 4 reset */
#define RCC_APB1RSTR_TIM5RST_Pos                 (3U)                          
#define RCC_APB1RSTR_TIM5RST_Msk                 (0x1UL << RCC_APB1RSTR_TIM5RST_Pos) /*!< 0x00000008 */
#define RCC_APB1RSTR_TIM5RST                     RCC_APB1RSTR_TIM5RST_Msk      /*!< Timer 5 reset */
#define RCC_APB1RSTR_TIM6RST_Pos                 (4U)                          
#define RCC_APB1RSTR_TIM6RST_Msk                 (0x1UL << RCC_APB1RSTR_TIM6RST_Pos) /*!< 0x00000010 */
#define RCC_APB1RSTR_TIM6RST                     RCC_APB1RSTR_TIM6RST_Msk      /*!< Timer 6 reset */
#define RCC_APB1RSTR_TIM7RST_Pos                 (5U)                          
#define RCC_APB1RSTR_TIM7RST_Msk                 (0x1UL << RCC_APB1RSTR_TIM7RST_Pos) /*!< 0x00000020 */
#define RCC_APB1RSTR_TIM7RST                     RCC_APB1RSTR_TIM7RST_Msk      /*!< Timer 7 reset */
#define RCC_APB1RSTR_TIM12RST_Pos                (6U)                          
#define RCC_APB1RSTR_TIM12RST_Msk                (0x1UL << RCC_APB1RSTR_TIM12RST_Pos) /*!< 0x00000040 */
#define RCC_APB1RSTR_TIM12RST                    RCC_APB1RSTR_TIM12RST_Msk     /*!< Timer 12 reset */
#define RCC_APB1RSTR_TIM13RST_Pos                (7U)                          
#define RCC_APB1RSTR_TIM13RST_Msk                (0x1UL << RCC_APB1RSTR_TIM13RST_Pos) /*!< 0x00000080 */
#define RCC_APB1RSTR_TIM13RST                    RCC_APB1RSTR_TIM13RST_Msk     /*!< Timer 13 reset */
#define RCC_APB1RSTR_TIM14RST_Pos                (8U)                          
#define RCC_APB1RSTR_TIM14RST_Msk                (0x1UL << RCC_APB1RSTR_TIM14RST_Pos) /*!< 0x00000100 */
#define RCC_APB1RSTR_TIM14RST                    RCC_APB1RSTR_TIM14RST_Msk     /*!< Timer 14 reset */
#define RCC_APB1RSTR_TIM18RST_Pos                (9U)                          
#define RCC_APB1RSTR_TIM18RST_Msk                (0x1UL << RCC_APB1RSTR_TIM18RST_Pos) /*!< 0x00000200 */
#define RCC_APB1RSTR_TIM18RST                    RCC_APB1RSTR_TIM18RST_Msk     /*!< Timer 18 reset */
#define RCC_APB1RSTR_WWDGRST_Pos                 (11U)                         
#define RCC_APB1RSTR_WWDGRST_Msk                 (0x1UL << RCC_APB1RSTR_WWDGRST_Pos) /*!< 0x00000800 */
#define RCC_APB1RSTR_WWDGRST                     RCC_APB1RSTR_WWDGRST_Msk      /*!< Window Watchdog reset */
#define RCC_APB1RSTR_SPI2RST_Pos                 (14U)                         
#define RCC_APB1RSTR_SPI2RST_Msk                 (0x1UL << RCC_APB1RSTR_SPI2RST_Pos) /*!< 0x00004000 */
#define RCC_APB1RSTR_SPI2RST                     RCC_APB1RSTR_SPI2RST_Msk      /*!< SPI2 reset */
#define RCC_APB1RSTR_SPI3RST_Pos                 (15U)                         
#define RCC_APB1RSTR_SPI3RST_Msk                 (0x1UL << RCC_APB1RSTR_SPI3RST_Pos) /*!< 0x00008000 */
#define RCC_APB1RSTR_SPI3RST                     RCC_APB1RSTR_SPI3RST_Msk      /*!< SPI3 reset */
#define RCC_APB1RSTR_USART2RST_Pos               (17U)                         
#define RCC_APB1RSTR_USART2RST_Msk               (0x1UL << RCC_APB1RSTR_USART2RST_Pos) /*!< 0x00020000 */
#define RCC_APB1RSTR_USART2RST                   RCC_APB1RSTR_USART2RST_Msk    /*!< USART 2 reset */
#define RCC_APB1RSTR_USART3RST_Pos               (18U)                         
#define RCC_APB1RSTR_USART3RST_Msk               (0x1UL << RCC_APB1RSTR_USART3RST_Pos) /*!< 0x00040000 */
#define RCC_APB1RSTR_USART3RST                   RCC_APB1RSTR_USART3RST_Msk    /*!< USART 3 reset */
#define RCC_APB1RSTR_I2C1RST_Pos                 (21U)                         
#define RCC_APB1RSTR_I2C1RST_Msk                 (0x1UL << RCC_APB1RSTR_I2C1RST_Pos) /*!< 0x00200000 */
#define RCC_APB1RSTR_I2C1RST                     RCC_APB1RSTR_I2C1RST_Msk      /*!< I2C 1 reset */
#define RCC_APB1RSTR_I2C2RST_Pos                 (22U)                         
#define RCC_APB1RSTR_I2C2RST_Msk                 (0x1UL << RCC_APB1RSTR_I2C2RST_Pos) /*!< 0x00400000 */
#define RCC_APB1RSTR_I2C2RST                     RCC_APB1RSTR_I2C2RST_Msk      /*!< I2C 2 reset */
#define RCC_APB1RSTR_CANRST_Pos                  (25U)                         
#define RCC_APB1RSTR_CANRST_Msk                  (0x1UL << RCC_APB1RSTR_CANRST_Pos) /*!< 0x02000000 */
#define RCC_APB1RSTR_CANRST                      RCC_APB1RSTR_CANRST_Msk       /*!< CAN reset */
#define RCC_APB1RSTR_DAC2RST_Pos                 (26U)                         
#define RCC_APB1RSTR_DAC2RST_Msk                 (0x1UL << RCC_APB1RSTR_DAC2RST_Pos) /*!< 0x04000000 */
#define RCC_APB1RSTR_DAC2RST                     RCC_APB1RSTR_DAC2RST_Msk      /*!< DAC 2 reset */
#define RCC_APB1RSTR_PWRRST_Pos                  (28U)                         
#define RCC_APB1RSTR_PWRRST_Msk                  (0x1UL << RCC_APB1RSTR_PWRRST_Pos) /*!< 0x10000000 */
#define RCC_APB1RSTR_PWRRST                      RCC_APB1RSTR_PWRRST_Msk       /*!< PWR reset */
#define RCC_APB1RSTR_DAC1RST_Pos                 (29U)                         
#define RCC_APB1RSTR_DAC1RST_Msk                 (0x1UL << RCC_APB1RSTR_DAC1RST_Pos) /*!< 0x20000000 */
#define RCC_APB1RSTR_DAC1RST                     RCC_APB1RSTR_DAC1RST_Msk      /*!< DAC 1 reset */
#define RCC_APB1RSTR_CECRST_Pos                  (30U)                         
#define RCC_APB1RSTR_CECRST_Msk                  (0x1UL << RCC_APB1RSTR_CECRST_Pos) /*!< 0x40000000 */
#define RCC_APB1RSTR_CECRST                      RCC_APB1RSTR_CECRST_Msk       /*!< CEC reset */

/******************  Bit definition for RCC_AHBENR register  ******************/
#define RCC_AHBENR_DMA1EN_Pos                    (0U)                          
#define RCC_AHBENR_DMA1EN_Msk                    (0x1UL << RCC_AHBENR_DMA1EN_Pos) /*!< 0x00000001 */
#define RCC_AHBENR_DMA1EN                        RCC_AHBENR_DMA1EN_Msk         /*!< DMA1 clock enable */
#define RCC_AHBENR_DMA2EN_Pos                    (1U)                          
#define RCC_AHBENR_DMA2EN_Msk                    (0x1UL << RCC_AHBENR_DMA2EN_Pos) /*!< 0x00000002 */
#define RCC_AHBENR_DMA2EN                        RCC_AHBENR_DMA2EN_Msk         /*!< DMA2 clock enable */
#define RCC_AHBENR_SRAMEN_Pos                    (2U)                          
#define RCC_AHBENR_SRAMEN_Msk                    (0x1UL << RCC_AHBENR_SRAMEN_Pos) /*!< 0x00000004 */
#define RCC_AHBENR_SRAMEN                        RCC_AHBENR_SRAMEN_Msk         /*!< SRAM interface clock enable */
#define RCC_AHBENR_FLITFEN_Pos                   (4U)                          
#define RCC_AHBENR_FLITFEN_Msk                   (0x1UL << RCC_AHBENR_FLITFEN_Pos) /*!< 0x00000010 */
#define RCC_AHBENR_FLITFEN                       RCC_AHBENR_FLITFEN_Msk        /*!< FLITF clock enable */
#define RCC_AHBENR_CRCEN_Pos                     (6U)                          
#define RCC_AHBENR_CRCEN_Msk                     (0x1UL << RCC_AHBENR_CRCEN_Pos) /*!< 0x00000040 */
#define RCC_AHBENR_CRCEN                         RCC_AHBENR_CRCEN_Msk          /*!< CRC clock enable */
#define RCC_AHBENR_GPIOAEN_Pos                   (17U)                         
#define RCC_AHBENR_GPIOAEN_Msk                   (0x1UL << RCC_AHBENR_GPIOAEN_Pos) /*!< 0x00020000 */
#define RCC_AHBENR_GPIOAEN                       RCC_AHBENR_GPIOAEN_Msk        /*!< GPIOA clock enable */
#define RCC_AHBENR_GPIOBEN_Pos                   (18U)                         
#define RCC_AHBENR_GPIOBEN_Msk                   (0x1UL << RCC_AHBENR_GPIOBEN_Pos) /*!< 0x00040000 */
#define RCC_AHBENR_GPIOBEN                       RCC_AHBENR_GPIOBEN_Msk        /*!< GPIOB clock enable */
#define RCC_AHBENR_GPIOCEN_Pos                   (19U)                         
#define RCC_AHBENR_GPIOCEN_Msk                   (0x1UL << RCC_AHBENR_GPIOCEN_Pos) /*!< 0x00080000 */
#define RCC_AHBENR_GPIOCEN                       RCC_AHBENR_GPIOCEN_Msk        /*!< GPIOC clock enable */
#define RCC_AHBENR_GPIODEN_Pos                   (20U)                         
#define RCC_AHBENR_GPIODEN_Msk                   (0x1UL << RCC_AHBENR_GPIODEN_Pos) /*!< 0x00100000 */
#define RCC_AHBENR_GPIODEN                       RCC_AHBENR_GPIODEN_Msk        /*!< GPIOD clock enable */
#define RCC_AHBENR_GPIOEEN_Pos                   (21U)                         
#define RCC_AHBENR_GPIOEEN_Msk                   (0x1UL << RCC_AHBENR_GPIOEEN_Pos) /*!< 0x00200000 */
#define RCC_AHBENR_GPIOEEN                       RCC_AHBENR_GPIOEEN_Msk        /*!< GPIOE clock enable */
#define RCC_AHBENR_GPIOFEN_Pos                   (22U)                         
#define RCC_AHBENR_GPIOFEN_Msk                   (0x1UL << RCC_AHBENR_GPIOFEN_Pos) /*!< 0x00400000 */
#define RCC_AHBENR_GPIOFEN                       RCC_AHBENR_GPIOFEN_Msk        /*!< GPIOF clock enable */
#define RCC_AHBENR_TSCEN_Pos                     (24U)                         
#define RCC_AHBENR_TSCEN_Msk                     (0x1UL << RCC_AHBENR_TSCEN_Pos) /*!< 0x01000000 */
#define RCC_AHBENR_TSCEN                         RCC_AHBENR_TSCEN_Msk          /*!< TS clock enable */

