MikroElektronika/core_packages/ARM/gcc_clang/def/stm/STM32F378RC/mcu.h
/********************  Bits definition for RTC_BKP18R register  ***************/
#define RTC_BKP18R_Pos               (0U)                                      
#define RTC_BKP18R_Msk               (0xFFFFFFFFUL << RTC_BKP18R_Pos)           /*!< 0xFFFFFFFF */
#define RTC_BKP18R                   RTC_BKP18R_Msk                            

/********************  Bits definition for RTC_BKP19R register  ***************/
#define RTC_BKP19R_Pos               (0U)                                      
#define RTC_BKP19R_Msk               (0xFFFFFFFFUL << RTC_BKP19R_Pos)           /*!< 0xFFFFFFFF */
#define RTC_BKP19R                   RTC_BKP19R_Msk                            

/********************  Bits definition for RTC_BKP20R register  ***************/
#define RTC_BKP20R_Pos               (0U)                                      
#define RTC_BKP20R_Msk               (0xFFFFFFFFUL << RTC_BKP20R_Pos)           /*!< 0xFFFFFFFF */
#define RTC_BKP20R                   RTC_BKP20R_Msk                            

/********************  Bits definition for RTC_BKP21R register  ***************/
#define RTC_BKP21R_Pos               (0U)                                      
#define RTC_BKP21R_Msk               (0xFFFFFFFFUL << RTC_BKP21R_Pos)           /*!< 0xFFFFFFFF */
#define RTC_BKP21R                   RTC_BKP21R_Msk                            

/********************  Bits definition for RTC_BKP22R register  ***************/
#define RTC_BKP22R_Pos               (0U)                                      
#define RTC_BKP22R_Msk               (0xFFFFFFFFUL << RTC_BKP22R_Pos)           /*!< 0xFFFFFFFF */
#define RTC_BKP22R                   RTC_BKP22R_Msk                            

/********************  Bits definition for RTC_BKP23R register  ***************/
#define RTC_BKP23R_Pos               (0U)                                      
#define RTC_BKP23R_Msk               (0xFFFFFFFFUL << RTC_BKP23R_Pos)           /*!< 0xFFFFFFFF */
#define RTC_BKP23R                   RTC_BKP23R_Msk                            

/********************  Bits definition for RTC_BKP24R register  ***************/
#define RTC_BKP24R_Pos               (0U)                                      
#define RTC_BKP24R_Msk               (0xFFFFFFFFUL << RTC_BKP24R_Pos)           /*!< 0xFFFFFFFF */
#define RTC_BKP24R                   RTC_BKP24R_Msk                            

/********************  Bits definition for RTC_BKP25R register  ***************/
#define RTC_BKP25R_Pos               (0U)                                      
#define RTC_BKP25R_Msk               (0xFFFFFFFFUL << RTC_BKP25R_Pos)           /*!< 0xFFFFFFFF */
#define RTC_BKP25R                   RTC_BKP25R_Msk                            

/********************  Bits definition for RTC_BKP26R register  ***************/
#define RTC_BKP26R_Pos               (0U)                                      
#define RTC_BKP26R_Msk               (0xFFFFFFFFUL << RTC_BKP26R_Pos)           /*!< 0xFFFFFFFF */
#define RTC_BKP26R                   RTC_BKP26R_Msk                            

/********************  Bits definition for RTC_BKP27R register  ***************/
#define RTC_BKP27R_Pos               (0U)                                      
#define RTC_BKP27R_Msk               (0xFFFFFFFFUL << RTC_BKP27R_Pos)           /*!< 0xFFFFFFFF */
#define RTC_BKP27R                   RTC_BKP27R_Msk                            

/********************  Bits definition for RTC_BKP28R register  ***************/
#define RTC_BKP28R_Pos               (0U)                                      
#define RTC_BKP28R_Msk               (0xFFFFFFFFUL << RTC_BKP28R_Pos)           /*!< 0xFFFFFFFF */
#define RTC_BKP28R                   RTC_BKP28R_Msk                            

/********************  Bits definition for RTC_BKP29R register  ***************/
#define RTC_BKP29R_Pos               (0U)                                      
#define RTC_BKP29R_Msk               (0xFFFFFFFFUL << RTC_BKP29R_Pos)           /*!< 0xFFFFFFFF */
#define RTC_BKP29R                   RTC_BKP29R_Msk                            

/********************  Bits definition for RTC_BKP30R register  ***************/
#define RTC_BKP30R_Pos               (0U)                                      
#define RTC_BKP30R_Msk               (0xFFFFFFFFUL << RTC_BKP30R_Pos)           /*!< 0xFFFFFFFF */
#define RTC_BKP30R                   RTC_BKP30R_Msk                            

/********************  Bits definition for RTC_BKP31R register  ***************/
#define RTC_BKP31R_Pos               (0U)                                      
#define RTC_BKP31R_Msk               (0xFFFFFFFFUL << RTC_BKP31R_Pos)           /*!< 0xFFFFFFFF */
#define RTC_BKP31R                   RTC_BKP31R_Msk                            

/******************** Number of backup registers ******************************/
#define RTC_BKP_NUMBER                       32

/******************************************************************************/
/*                                                                            */
/*             Sigma-Delta Analog to Digital Converter (SDADC)                */
/*                                                                            */
/******************************************************************************/

/*****************  Bit definition for SDADC_CR1 register  ********************/
#define SDADC_CR1_EOCALIE_Pos         (0U)                                     
#define SDADC_CR1_EOCALIE_Msk         (0x1UL << SDADC_CR1_EOCALIE_Pos)          /*!< 0x00000001 */
#define SDADC_CR1_EOCALIE             SDADC_CR1_EOCALIE_Msk                    /*!< End of calibration interrupt enable */
#define SDADC_CR1_JEOCIE_Pos          (1U)                                     
#define SDADC_CR1_JEOCIE_Msk          (0x1UL << SDADC_CR1_JEOCIE_Pos)           /*!< 0x00000002 */
#define SDADC_CR1_JEOCIE              SDADC_CR1_JEOCIE_Msk                     /*!< Injected end of conversion interrupt enable */
#define SDADC_CR1_JOVRIE_Pos          (2U)                                     
#define SDADC_CR1_JOVRIE_Msk          (0x1UL << SDADC_CR1_JOVRIE_Pos)           /*!< 0x00000004 */
#define SDADC_CR1_JOVRIE              SDADC_CR1_JOVRIE_Msk                     /*!< Injected data overrun interrupt enable */
#define SDADC_CR1_REOCIE_Pos          (3U)                                     
#define SDADC_CR1_REOCIE_Msk          (0x1UL << SDADC_CR1_REOCIE_Pos)           /*!< 0x00000008 */
#define SDADC_CR1_REOCIE              SDADC_CR1_REOCIE_Msk                     /*!< Regular end of conversion interrupt enable */
#define SDADC_CR1_ROVRIE_Pos          (4U)                                     
#define SDADC_CR1_ROVRIE_Msk          (0x1UL << SDADC_CR1_ROVRIE_Pos)           /*!< 0x00000010 */
#define SDADC_CR1_ROVRIE              SDADC_CR1_ROVRIE_Msk                     /*!< Regular data overrun interrupt enable */
#define SDADC_CR1_REFV_Pos            (8U)                                     
#define SDADC_CR1_REFV_Msk            (0x3UL << SDADC_CR1_REFV_Pos)             /*!< 0x00000300 */
#define SDADC_CR1_REFV                SDADC_CR1_REFV_Msk                       /*!< Reference voltage selection */
#define SDADC_CR1_REFV_0              (0x1UL << SDADC_CR1_REFV_Pos)             /*!< 0x00000100 */
#define SDADC_CR1_REFV_1              (0x2UL << SDADC_CR1_REFV_Pos)             /*!< 0x00000200 */
#define SDADC_CR1_SLOWCK_Pos          (10U)                                    
#define SDADC_CR1_SLOWCK_Msk          (0x1UL << SDADC_CR1_SLOWCK_Pos)           /*!< 0x00000400 */
#define SDADC_CR1_SLOWCK              SDADC_CR1_SLOWCK_Msk                     /*!< Slow clock mode enable */
#define SDADC_CR1_SBI_Pos             (11U)                                    
#define SDADC_CR1_SBI_Msk             (0x1UL << SDADC_CR1_SBI_Pos)              /*!< 0x00000800 */
#define SDADC_CR1_SBI                 SDADC_CR1_SBI_Msk                        /*!< Enter standby mode when idle */
#define SDADC_CR1_PDI_Pos             (12U)                                    
#define SDADC_CR1_PDI_Msk             (0x1UL << SDADC_CR1_PDI_Pos)              /*!< 0x00001000 */
#define SDADC_CR1_PDI                 SDADC_CR1_PDI_Msk                        /*!< Enter power down mode when idle */
#define SDADC_CR1_JSYNC_Pos           (14U)                                    
#define SDADC_CR1_JSYNC_Msk           (0x1UL << SDADC_CR1_JSYNC_Pos)            /*!< 0x00004000 */
#define SDADC_CR1_JSYNC               SDADC_CR1_JSYNC_Msk                      /*!< Launch a injected conversion synchronously with SDADC1 */
#define SDADC_CR1_RSYNC_Pos           (15U)                                    
#define SDADC_CR1_RSYNC_Msk           (0x1UL << SDADC_CR1_RSYNC_Pos)            /*!< 0x00008000 */
#define SDADC_CR1_RSYNC               SDADC_CR1_RSYNC_Msk                      /*!< Launch regular conversion synchronously with SDADC1 */
#define SDADC_CR1_JDMAEN_Pos          (16U)                                    
#define SDADC_CR1_JDMAEN_Msk          (0x1UL << SDADC_CR1_JDMAEN_Pos)           /*!< 0x00010000 */
#define SDADC_CR1_JDMAEN              SDADC_CR1_JDMAEN_Msk                     /*!< DMA channel enabled to read data for the injected channel group */
#define SDADC_CR1_RDMAEN_Pos          (17U)                                    
#define SDADC_CR1_RDMAEN_Msk          (0x1UL << SDADC_CR1_RDMAEN_Pos)           /*!< 0x00020000 */
#define SDADC_CR1_RDMAEN              SDADC_CR1_RDMAEN_Msk                     /*!< DMA channel enabled to read data for the regular channel */
#define SDADC_CR1_INIT_Pos            (31U)                                    
#define SDADC_CR1_INIT_Msk            (0x1UL << SDADC_CR1_INIT_Pos)             /*!< 0x80000000 */
#define SDADC_CR1_INIT                SDADC_CR1_INIT_Msk                       /*!< Initialization mode request */

/*****************  Bit definition for SDADC_CR2 register  ********************/
#define SDADC_CR2_ADON_Pos            (0U)                                     
#define SDADC_CR2_ADON_Msk            (0x1UL << SDADC_CR2_ADON_Pos)             /*!< 0x00000001 */
#define SDADC_CR2_ADON                SDADC_CR2_ADON_Msk                       /*!< SDADC enable */
#define SDADC_CR2_CALIBCNT_Pos        (1U)                                     
#define SDADC_CR2_CALIBCNT_Msk        (0x3UL << SDADC_CR2_CALIBCNT_Pos)         /*!< 0x00000006 */
#define SDADC_CR2_CALIBCNT            SDADC_CR2_CALIBCNT_Msk                   /*!< Number of calibration sequences to be performed */
#define SDADC_CR2_CALIBCNT_0          (0x1UL << SDADC_CR2_CALIBCNT_Pos)         /*!< 0x00000002 */
#define SDADC_CR2_CALIBCNT_1          (0x2UL << SDADC_CR2_CALIBCNT_Pos)         /*!< 0x00000004 */
#define SDADC_CR2_STARTCALIB_Pos      (4U)                                     
#define SDADC_CR2_STARTCALIB_Msk      (0x1UL << SDADC_CR2_STARTCALIB_Pos)       /*!< 0x00000010 */
#define SDADC_CR2_STARTCALIB          SDADC_CR2_STARTCALIB_Msk                 /*!< Start calibration */
#define SDADC_CR2_JCONT_Pos           (5U)                                     
#define SDADC_CR2_JCONT_Msk           (0x1UL << SDADC_CR2_JCONT_Pos)            /*!< 0x00000020 */
#define SDADC_CR2_JCONT               SDADC_CR2_JCONT_Msk                      /*!< Continuous mode selection for injected conversions */
#define SDADC_CR2_JDS_Pos             (6U)                                     
#define SDADC_CR2_JDS_Msk             (0x1UL << SDADC_CR2_JDS_Pos)              /*!< 0x00000040 */
#define SDADC_CR2_JDS                 SDADC_CR2_JDS_Msk                        /*!< Delay start of injected conversions */
#define SDADC_CR2_JEXTSEL_Pos         (8U)                                     
#define SDADC_CR2_JEXTSEL_Msk         (0xFUL << SDADC_CR2_JEXTSEL_Pos)          /*!< 0x00000F00 */
#define SDADC_CR2_JEXTSEL             SDADC_CR2_JEXTSEL_Msk                    /*!< Trigger signal selection for launching injected conversions */
#define SDADC_CR2_JEXTSEL_0           (0x1UL << SDADC_CR2_JEXTSEL_Pos)          /*!< 0x00000100 */
#define SDADC_CR2_JEXTSEL_1           (0x2UL << SDADC_CR2_JEXTSEL_Pos)          /*!< 0x00000200 */
#define SDADC_CR2_JEXTSEL_2           (0x4UL << SDADC_CR2_JEXTSEL_Pos)          /*!< 0x00000400 */
#define SDADC_CR2_JEXTSEL_3           (0x8UL << SDADC_CR2_JEXTSEL_Pos)          /*!< 0x00000800 */
#define SDADC_CR2_JEXTEN_Pos          (13U)                                    
#define SDADC_CR2_JEXTEN_Msk          (0x3UL << SDADC_CR2_JEXTEN_Pos)           /*!< 0x00006000 */
#define SDADC_CR2_JEXTEN              SDADC_CR2_JEXTEN_Msk                     /*!< Trigger enable and trigger edge selection for injected conversions */
#define SDADC_CR2_JEXTEN_0            (0x1UL << SDADC_CR2_JEXTEN_Pos)           /*!< 0x00002000 */
#define SDADC_CR2_JEXTEN_1            (0x2UL << SDADC_CR2_JEXTEN_Pos)           /*!< 0x00004000 */
#define SDADC_CR2_JSWSTART_Pos        (15U)                                    
#define SDADC_CR2_JSWSTART_Msk        (0x1UL << SDADC_CR2_JSWSTART_Pos)         /*!< 0x00008000 */
#define SDADC_CR2_JSWSTART            SDADC_CR2_JSWSTART_Msk                   /*!< Start a conversion of the injected group of channels */
#define SDADC_CR2_RCH_Pos             (16U)                                    
#define SDADC_CR2_RCH_Msk             (0xFUL << SDADC_CR2_RCH_Pos)              /*!< 0x000F0000 */
#define SDADC_CR2_RCH                 SDADC_CR2_RCH_Msk                        /*!< Regular channel selection */
#define SDADC_CR2_RCH_0               (0x1UL << SDADC_CR2_RCH_Pos)              /*!< 0x00010000 */
#define SDADC_CR2_RCH_1               (0x2UL << SDADC_CR2_RCH_Pos)              /*!< 0x00020000 */
#define SDADC_CR2_RCH_2               (0x4UL << SDADC_CR2_RCH_Pos)              /*!< 0x00040000 */
#define SDADC_CR2_RCH_3               (0x8UL << SDADC_CR2_RCH_Pos)              /*!< 0x00080000 */
#define SDADC_CR2_RCONT_Pos           (22U)                                    
#define SDADC_CR2_RCONT_Msk           (0x1UL << SDADC_CR2_RCONT_Pos)            /*!< 0x00400000 */
#define SDADC_CR2_RCONT               SDADC_CR2_RCONT_Msk                      /*!< Continuous mode selection for regular conversions */
#define SDADC_CR2_RSWSTART_Pos        (23U)                                    
#define SDADC_CR2_RSWSTART_Msk        (0x1UL << SDADC_CR2_RSWSTART_Pos)         /*!< 0x00800000 */
#define SDADC_CR2_RSWSTART            SDADC_CR2_RSWSTART_Msk                   /*!< Software start of a conversion on the regular channel */
#define SDADC_CR2_FAST_Pos            (24U)                                    
#define SDADC_CR2_FAST_Msk            (0x1UL << SDADC_CR2_FAST_Pos)             /*!< 0x01000000 */
#define SDADC_CR2_FAST                SDADC_CR2_FAST_Msk                       /*!< Fast conversion mode selection */

/********************  Bit definition for SDADC_ISR register  *****************/
#define SDADC_ISR_EOCALF_Pos          (0U)                                     
#define SDADC_ISR_EOCALF_Msk          (0x1UL << SDADC_ISR_EOCALF_Pos)           /*!< 0x00000001 */
#define SDADC_ISR_EOCALF              SDADC_ISR_EOCALF_Msk                     /*!< End of calibration flag */
#define SDADC_ISR_JEOCF_Pos           (1U)                                     
#define SDADC_ISR_JEOCF_Msk           (0x1UL << SDADC_ISR_JEOCF_Pos)            /*!< 0x00000002 */
#define SDADC_ISR_JEOCF               SDADC_ISR_JEOCF_Msk                      /*!< End of injected conversion flag */
#define SDADC_ISR_JOVRF_Pos           (2U)                                     
#define SDADC_ISR_JOVRF_Msk           (0x1UL << SDADC_ISR_JOVRF_Pos)            /*!< 0x00000004 */
#define SDADC_ISR_JOVRF               SDADC_ISR_JOVRF_Msk                      /*!< Injected conversion overrun flag */
#define SDADC_ISR_REOCF_Pos           (3U)                                     
#define SDADC_ISR_REOCF_Msk           (0x1UL << SDADC_ISR_REOCF_Pos)            /*!< 0x00000008 */
#define SDADC_ISR_REOCF               SDADC_ISR_REOCF_Msk                      /*!< End of regular conversion flag */
#define SDADC_ISR_ROVRF_Pos           (4U)                                     
#define SDADC_ISR_ROVRF_Msk           (0x1UL << SDADC_ISR_ROVRF_Pos)            /*!< 0x00000010 */
#define SDADC_ISR_ROVRF               SDADC_ISR_ROVRF_Msk                      /*!< Regular conversion overrun flag */
#define SDADC_ISR_CALIBIP_Pos         (12U)                                    
#define SDADC_ISR_CALIBIP_Msk         (0x1UL << SDADC_ISR_CALIBIP_Pos)          /*!< 0x00001000 */
#define SDADC_ISR_CALIBIP             SDADC_ISR_CALIBIP_Msk                    /*!< Calibration in progress status */
#define SDADC_ISR_JCIP_Pos            (13U)                                    
#define SDADC_ISR_JCIP_Msk            (0x1UL << SDADC_ISR_JCIP_Pos)             /*!< 0x00002000 */
#define SDADC_ISR_JCIP                SDADC_ISR_JCIP_Msk                       /*!< Injected conversion in progress status */
#define SDADC_ISR_RCIP_Pos            (14U)                                    
#define SDADC_ISR_RCIP_Msk            (0x1UL << SDADC_ISR_RCIP_Pos)             /*!< 0x00004000 */
#define SDADC_ISR_RCIP                SDADC_ISR_RCIP_Msk                       /*!< Regular conversion in progress status */
#define SDADC_ISR_STABIP_Pos          (15U)                                    
#define SDADC_ISR_STABIP_Msk          (0x1UL << SDADC_ISR_STABIP_Pos)           /*!< 0x00008000 */
#define SDADC_ISR_STABIP              SDADC_ISR_STABIP_Msk                     /*!< Stabilization in progress status */
#define SDADC_ISR_INITRDY_Pos         (31U)                                    
#define SDADC_ISR_INITRDY_Msk         (0x1UL << SDADC_ISR_INITRDY_Pos)          /*!< 0x80000000 */
#define SDADC_ISR_INITRDY             SDADC_ISR_INITRDY_Msk                    /*!< Initialization mode is ready */

